"use client";

import Image from "next/image";
import Link from "next/link";

export default function BlogPage() {
  return (
    <main className="bg-[#F3F3F3] pb-[80px]">
      <div className="mx-auto max-w-[1800px] px-[60px]
        max-[768px]:px-[30px]
        max-[640px]:px-[15px]">

        <div className="pt-[20px] text-[22px] max-[768px]:text-[20px] text-[#8E8E8E]">
          <Link href="/" className="hover:text-[#61B8BE]">Домашня сторінка</Link>
          <span className="mx-6">{" > "}</span>
          <Link href="/blog" className="hover:text-[#61B8BE]">Блог</Link>
          <span className="mx-6">{" >"}</span><span>Сторінка блогу</span>
        </div>

        <h1 className="mt-[20px] text-center text-[48px] font-bold text-[#231F20]
            max-[768px]:text-[40px]
            max-[640px]:text-[30px]">
          Як вибрати ідеальні меблі для вашого дому
        </h1>

        <div className="mt-[30px] flex justify-center gap-[80px]
            max-[768px]:justify-center">
          <Image src="/images/blog-page/11.png" alt="" width={430} height={330} className="
              object-cover
              max-[768px]:h-auto
              max-[768px]:w-full
              max-[768px]:max-w-[600px]"/>

          <Image src="/images/blog-page/12.png" alt="" width={430} height={330} className=" object-cover
            max-[768px]:hidden"/>

          <Image src="/images/blog-page/13.png" alt="" width={430} height={330} className="
              object-cover
              max-[768px]:hidden"/>
        </div>

        <h2 className="mt-[40px] text-[36px] font-bold
            max-[768px]:text-[36px]
            max-[640px]:text-[28px]">
          Визначте стиль
        </h2>

        <p className="mt-[20px] text-[24px] leading-[1.4] text-[#231F20] text-justify
          max-[768px]:text-[18px]
          max-[640px]:text-[16px]">
          Вибір меблів — це не просто покупка нових предметів інтер’єру. Це створення атмосфери, де ви будете відчувати себе комфортно і затишно. Ми підготували кілька порад, які допоможуть вам знайти ідеальні меблі для вашого дому. Перш ніж почати шопінг, подумайте про стиль вашого інтер’єру. Чи віддаєте ви перевагу класичному, сучасному, мінімалістичному або скандинавському стилю? Вибір стилю допоможе звузити ваші пошуки і зробити їх більш цілеспрямованими. Перед покупкою меблів виміряйте приміщення. Пам’ятайте, що меблі повинні не лише вписуватися в інтер’єр, але й залишати достатньо місця для пересування. Використовуйте схеми або онлайн-планувальники, щоб візуалізувати, як нові меблі виглядатимуть у вашому просторі. Не економте на якості! Вибирайте меблі з надійних матеріалів, які витримають навантаження та прослужать вам довгий час. Дерево, метал та якісні текстильні матеріали — це те, на що варто звернути увагу.
        </p>

        <h2 className="mt-[30px] text-[36px] font-bold
            max-[768px]:text-[36px]
            max-[640px]:text-[28px]">
          Комфорт — понад усе
        </h2>

        <p className="mt-[20px] text-[24px] leading-[1.4] text-[#231F20] text-justify
            max-[768px]:text-[18px]
            max-[640px]:text-[16px]">
          Якщо ви обираєте меблі для відпочинку, такі як диван чи крісло, обов’язково протестуйте їх. Сідайте, ляжте — відчуйте, чи вам зручно. Комфорт — це ключовий фактор, адже меблі повинні бути не лише красивими, а й практичними. Коли ви обираєте меблі, намагайтеся створити гармонійний простір. Комбінуйте кольори, текстури та форми, щоб ваше житло виглядало цілісно. Не бійтеся експериментувати, але пам’ятайте про баланс! Сучасні меблі повинні бути не лише стильними, але й функціональними. Вибирайте предмети, які можуть виконувати кілька ролей. Наприклад, розкладний диван або стіл з ящиками для зберігання — це практичні рішення для будь-якого дому. Коли ви обираєте меблі, намагайтеся створити гармонійний простір. Комбінуйте кольори, текстури та форми, щоб ваше житло виглядало цілісно. Не бійтеся експериментувати, але пам’ятайте про баланс! Наприклад, сучасні меблі з гладкими поверхнями можуть чудово поєднуватися з текстурованими елементами, такими як в’язані пледи чи декоративні подушки.
        </p>

        <div className="mt-[30px] flex justify-center gap-[35px]">
          <Image src="/images/blog-page/21.png" alt="" width={392} height={350} className="
              object-cover
              max-[768px]:h-auto
              max-[768px]:w-full
              max-[768px]:max-w-[600px]"/>

          <Image src="/images/blog-page/22.png" alt="" width={392} height={350} className="object-cover max-[768px]:hidden"/>

          <Image src="/images/blog-page/23.png" alt="" width={392} height={350} className="object-cover max-[768px]:hidden"/>

          <Image src="/images/blog-page/24.png" alt="" width={392} height={250} className="object-cover max-[768px]:hidden"/>
        </div>

        <h2 className="mt-[40px] text-[36px] font-bold
            max-[768px]:text-[36px]
            max-[640px]:text-[28px]">
          Меблевий дизайн не стоїть на місці
        </h2>

        <p className="mt-[20px] text-[24px] leading-[1.4] text-[#231F20] text-justify
            max-[768px]:text-[18px]
            max-[640px]:text-[16px]">
          Сучасні меблі повинні бути не лише стильними, але й функціональними. Вибирайте предмети, які можуть виконувати кілька ролей. Наприклад, розкладний диван — це практичне рішення для малогабаритних квартир, а столи з вбудованими ящиками і поличками дозволять зберігати порядок у вашому домі. Якщо у вас є діти або домашні тварини, обирайте меблі з матеріалів, які легко чистити і які стійкі до подряпин і забруднень. Наприклад, тканини з високим вмістом поліестеру або шкіра легко піддаються очищенню і є більш практичними в таких умовах. Декоративні елементи можуть значно змінити вигляд вашого простору. Розгляньте можливість додавання аксесуарів, таких як подушки, покривала, килими та картини. Ці деталі допоможуть підкреслити ваш стиль і створити затишну атмосферу. Купівля меблів — це серйозний крок, тому не поспішайте з рішенням. Дайте собі час на обдумування, порівняння різних варіантів і вибір найбільш підходящих. Зберіть натхнення, переглядаючи інтер’єрні журнали, соціальні мережі або спеціалізовані сайти. Перш ніж почати покупки, визначте бюджет. Вибір меблів у різних цінових категоріях може бути величезним, але важливо знайти баланс між ціною і якістю. Розгляньте можливість покупки меблів на розстрочку, якщо це дозволяє ваш бюджет. Сьогодні все більше людей звертають увагу на екологічні аспекти при виборі меблів. Обирайте продукцію з екологічно чистих матеріалів, які не завдають шкоди навколишньому середовищу. Деревина з сертифікованих лісів, меблі, виготовлені з вторинних матеріалів, або продукція з нульовим вуглецевим слідом — це відмінний вибір для тих, хто піклується про природу.
        </p>

        <div className="mt-[40px] flex justify-center gap-[100px]">
          <Image src="/images/blog-page/31.png" alt="" width={550} height={420} className="object-cover
              max-[768px]:h-auto
              max-[768px]:w-full
              max-[768px]:max-w-[600px]"/>

          <Image src="/images/blog-page/32.png" alt="" width={550} height={420} className="
              object-cover
              max-[768px]:hidden"/>
        </div>

        <p className="mt-[40px] text-[24px] leading-[1.4] text-[#231F20] text-justify
            max-[768px]:text-[20px]
            max-[640px]:text-[18px]">
          Пам’ятайте, що меблі — це інвестиція у ваш комфорт і затишок. У нашому інтернет-магазині ви знайдете широкий асортимент меблів на будь-який смак та бюджет. Створіть свій ідеальний простір, де вам буде затишно і комфортно, і не бійтеся експериментувати! Забезпечте собі затишок і комфорт, вибираючи меблі, які відповідають вашим потребам і стилю життя. У нашому інтернет-магазині ви знайдете великий асортимент, що дозволить вам створити ідеальне середовище для вашої родини.
        </p>
      </div>
    </main>
  );
}